In [3]:
import pandas as pd
import numpy as np

In [5]:
np.random.seed(0)
num_days = 100
data_rng = pd.date_range(start='2023-01-01',end = '2023-04-10', freq = 'D')
df = pd.DataFrame(data_rng, columns=['date'])

In [6]:
df.head()

        date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [7]:
df['Year'] = df['date'].dt.year
df['Month'] = df['date'].dt.month
df['Day'] = df['date'].dt.day

In [8]:
df['day-of-week'] = df['date'].dt.dayofweek

In [9]:
df.head()

        date  Year  Month  Day  day-of-week
0 2023-01-01  2023      1    1            6
1 2023-01-02  2023      1    2            0
2 2023-01-03  2023      1    3            1
3 2023-01-04  2023      1    4            2
4 2023-01-05  2023      1    5            3

In [17]:
num_period = 100
data_rng = pd.date_range(start='2023-01-01', periods=num_period, freq='H')
df = pd.DataFrame(data_rng, columns=['timestamp'])

C:\Users\acer\AppData\Local\Temp\ipykernel_3088\1057605556.py:2: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  data_rng = pd.date_range(start='2023-01-01', periods=num_period, freq='H')

In [18]:
df.head()

            timestamp
0 2023-01-01 00:00:00
1 2023-01-01 01:00:00
2 2023-01-01 02:00:00
3 2023-01-01 03:00:00
4 2023-01-01 04:00:00

In [19]:
df['day'] = df['timestamp'].dt.day
df['time'] = df['timestamp'].dt.time
df['hour'] = df['timestamp'].dt.hour
df['minute'] = df['timestamp'].dt.minute
df['month'] = df['timestamp'].dt.month

In [20]:
df.head()

            timestamp  day      time  hour  minute  month
0 2023-01-01 00:00:00    1  00:00:00     0       0      1
1 2023-01-01 01:00:00    1  01:00:00     1       0      1
2 2023-01-01 02:00:00    1  02:00:00     2       0      1
3 2023-01-01 03:00:00    1  03:00:00     3       0      1
4 2023-01-01 04:00:00    1  04:00:00     4       0      1

# Handling Mixed Data

In [23]:
data = {
    'mixed-feature': ['B123','A344','A431','B153']
}
df = pd.DataFrame(data)

In [24]:
df

  mixed-feature
0          B123
1          A344
2          A431
3          B153

In [25]:
df['Category'] = df['mixed-feature'].str[0]
df['Numerical'] = df['mixed-feature'].str[1:].astype(int)

In [26]:
df

  mixed-feature Category  Numerical
0          B123        B        123
1          A344        A        344
2          A431        A        431
3          B153        B        153